## [Excel => DataFrame 저장 다루기]

(1) 모듈 로딩 <hr>

In [1]:
import pandas as pd

(2) 데이터 준비

In [2]:
file1='../DATA/Single Worksheet.xlsx'
file2='../DATA/Multiple Worksheets.xlsx'

(3) Excel=> DataFrame 저장하기

In [3]:
pd.read_excel(file1,header=None,usecols=[1,3])

           1       3
0  Last Name  Gender
1      James       M
2    Hawkins       M
3        Day       F
4       Ruiz       F
5      Gomez       F

In [4]:
pd.read_excel(file2)

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [5]:
pd.read_excel(file2,sheet_name='Data 1')

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [6]:
pd.read_excel(file2,sheet_name='Data 3')    #엑셀 시트를 가져올떄 왼쪽부터 번호가 0,1,2 즉 0부터 시작한다!

  First Name  Last Name     City Gender
0     Robert     Miller  Seattle      M
1       Tara     Garcia  Phoenix      F
2    Raphael  Rodriguez  Orlando      M

# 3 [Json ==> DataFrame 저장하기]

(1) 데이터 준비

In [7]:
file3='../DATA/nobel.json'

(2) JSON--> DataFrame으로 저장

In [8]:
nobelDF=pd.read_json(file3)
nobelDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 646 entries, 0 to 645
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   prizes  646 non-null    object
dtypes: object(1)
memory usage: 5.2+ KB

(3) 데이터 확인

In [9]:
print(nobelDF.head(3), nobelDF.tail(3),sep="\n\n")

                                              prizes
0  {'year': '2019', 'category': 'chemistry', 'lau...
1  {'year': '2019', 'category': 'economics', 'lau...
2  {'year': '2019', 'category': 'literature', 'la...

                                                prizes
643  {'year': '1901', 'category': 'peace', 'laureat...
644  {'year': '1901', 'category': 'physics', 'laure...
645  {'year': '1901', 'category': 'medicine', 'laur...

(4) 데이터 추출

In [10]:
# 행 추출 => iloc[],loc[]
type(nobelDF.iloc[0]),nobelDF.iloc[0]

(pandas.core.series.Series,
 prizes    {'year': '2019', 'category': 'chemistry', 'lau...
 Name: 0, dtype: object)

In [11]:
type(nobelDF.iloc[0]['prizes'])

dict

In [12]:
oneData=nobelDF.iloc[0]['prizes']
type(oneData)

dict

In [13]:
for k,v in oneData.items():
    print(f'[{k}]\n====> {v}')
    if k=='laureates':
        for d  in v: 
            for k1,v1 in d.items():
                print(k1,v1)

[year]
====> 2019
[category]
====> chemistry
[laureates]
====> [{'id': '976', 'firstname': 'John', 'surname': 'Goodenough', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}, {'id': '977', 'firstname': 'M. Stanley', 'surname': 'Whittingham', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}, {'id': '978', 'firstname': 'Akira', 'surname': 'Yoshino', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}]
id 976
firstname John
surname Goodenough
motivation "for the development of lithium-ion batteries"
share 3
id 977
firstname M. Stanley
surname Whittingham
motivation "for the development of lithium-ion batteries"
share 3
id 978
firstname Akira
surname Yoshino
motivation "for the development of lithium-ion batteries"
share 3

In [14]:
# 행 추출 => iloc[[n1,....]]/loc[]
nobelDF.iloc[[0,3]]

                                              prizes
0  {'year': '2019', 'category': 'chemistry', 'lau...
3  {'year': '2019', 'category': 'peace', 'laureat...

- json 중첩 데이터의 다중 반복문====> 단일 리스트 형태 처리 : 평탄화//정규화

In [15]:
pd.json_normalize(oneData)

   year   category                                          laureates
0  2019  chemistry  [{'id': '976', 'firstname': 'John', 'surname':...

In [16]:
pd.json_normalize(oneData,record_path='laureates')

,id,firstname,surname,motivation,share
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3
2,978,Akira,Yoshino,"""for the development of lithium-ion batteries""",3

In [17]:
pd.json_normalize(oneData,record_path='laureates', meta=['year','category'])  #meta:공통으로 집어 넣을 것 넣어줌

,id,firstname,surname,motivation,share,year,category
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3,2019,chemistry
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3,2019,chemistry
2,978,Akira,Yoshino,"""for the development of lithium-ion batteries""",3,2019,chemistry

- 모든 행에 대한 정규화/평탄화 진행

In [18]:
# 컬럼 읽기 => DF객체변수명['컬럼명'],DF객체변수명.컬럼명
# ===> 모든 행에 record_path에 해당하는 키(key)가 존재해야 함!!
# 없는 행에 record_path 에 해당하는 키 추가
for data in nobelDF.prizes:
    # print(type(data),data.keys(),end='\n\n')
    # 해당 dict에 laureates 키가 없다면 추가 (빈 곳에 빈 리스트를 넣어주기)
    data.setdefault('laureates',[])

In [19]:
nobelDF2=pd.json_normalize(nobelDF.prizes,record_path='laureates',meta=['year','category'])
nobelDF2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 950 entries, 0 to 949
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          950 non-null    object
 1   firstname   950 non-null    object
 2   surname     921 non-null    object
 3   motivation  950 non-null    object
 4   share       950 non-null    object
 5   year        950 non-null    object
 6   category    950 non-null    object
dtypes: object(7)
memory usage: 52.1+ KB

- (7)JSON의 다양한 방식의 DataFrame 저장하기=> orinet 파라미터
- json 기본형태={k:v} 꼴

In [34]:
json_data ='''
[
{"id":"1","name":"sravan","age":22 },
{"id":"2","name":"harsha","age":22 },
{"id":"3","name":"deepika","age":21 },
{"id":"4","name":"jyothika","age":23 }
]'''

- orient = 'record' 설정 => JSON 파일 데이터를 행 단위로 읽어서 DataFrame에 저장

In [35]:
df= pd.read_json(json_data) #, orient='records')
print(df)

   id      name  age
0   1    sravan   22
1   2    harsha   22
2   3   deepika   21
3   4  jyothika   23

In [31]:
# 데이터 => 키:{값}
json_data2 = '''{
    "student-1":{"id":"1","name":"sravan","age":22} ,
    "student-2":{"id":"2","name":"harsha","age":22} ,
    "student-3":{"id":"3","name":"deepika","age":21} ,
    "student-4":{"id":"4","name":"jyothika","age":23} 
                }'''

In [40]:
#키=> 인덱스로 설정
df=pd.read_json(json_data2,orient='index')
print(df)

           id      name  age
student-1   1    sravan   22
student-2   2    harsha   22
student-3   3   deepika   21
student-4   4  jyothika   23

In [43]:
#키=> 컬럼
df=pd.read_json(json_data2)#,orient='columns'
print(df)

     student-1 student-2 student-3 student-4
id           1         2         3         4
name    sravan    harsha   deepika  jyothika
age         22        22        21        23

In [42]:
#키=> 컬럼
df=pd.read_json(json_data2).T#,orient='columns'
print(df)

          id      name age
student-1  1    sravan  22
student-2  2    harsha  22
student-3  3   deepika  21
student-4  4  jyothika  23

In [44]:
#JSON Format
json_data3 = '''
[
    [ "1", "sravan",22 ],
    [ "2", "harsha",22 ],
    [ "3", "deepika",21 ],
    [ "4", "jyothika",23 ]
]
'''

In [ ]:
df=pd.read_json(json_data3,orient='values')
#Display the Dataframe
print(df)